# Task 4.6 Combining & Exporting Data (part 1)

### Contents

### 1.0 Import Libraries

### 2.0 Import Data

### 3.0 Preparing Dataframes

### 4.0 Combining Dataframes
### 5.0 Exporting dataframe as pickle

## 1.0 Import Libraries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

## 2.0 Import Data

In [2]:
#create path
path = r'C:\Users\Asus 17\OneDrive\Desktop\Achievement 4\instacart_basket_analysis'

In [9]:
#import orders prior
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders_products_prior.csv'),)

In [17]:
# import orders_checked
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'))

## 3.0 Preparing Dataframes

In [18]:
#have a look
df_ords.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

In [13]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [20]:
#check shape of new df
df_ords_prior.shape

(32434489, 4)

In [21]:
#rename df_ords columns
df_ords.columns = ['bad', 'bad_1', 'order_id', 'user_id', 'order_number', 'order_day_of_week', 'order_hour_of_day', 'days_since_prior_order']

In [22]:
# check it worked
df_ords.head()

,bad,bad_1,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,0,0,2539329,1,1,2,8,NaN
1,1,1,2398795,1,2,3,7,15.0
2,2,2,473747,1,3,3,12,21.0
3,3,3,2254736,1,4,4,7,29.0
4,4,4,431534,1,5,4,15,28.0

In [23]:
#make a new df without the unnecessary indecies
df_ords_better = df_ords.drop(columns = ['bad', 'bad_1'])

In [24]:
#check it worked
df_ords_better.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [25]:
# overwrite df_ords
df_ords = df_ords_better

In [26]:
#check it worked
df_ords.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [29]:
#check df_ords shape
df_ords.shape

(3421083, 6)

In [28]:
#check ords_prior shape
df_ords_prior.shape

(32434489, 4)

## 4.0 Combining Dataframes

In [30]:
# making a mega set from the two
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [31]:
#taking a look
df_merged_large.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [32]:
# check for match
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [33]:
#and for shape
df_merged_large.shape

(32434489, 10)

## 5.0 Exporting dataframe as pickle

In [34]:
#export the super dataframe as a pickle
df_merged_large.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))